{
  "fullstack": "Full-stack",
  "frontend": "Frontend",
  "dissertation": "Thesis",
  "peace_of_mind_title": "Peace of Mind",
  "peace_of_mind_desc": "Peace of Mind connects the families of geriatric patients with their caregivers, providing a shared space to plan tasks such as medication, hygiene, meals, and medical appointments. Caregivers record the completion of tasks and leave notes on activities, giving families insight into the well-being of their loved ones.",
  "french_language_title": "French Language Application",
  "french_language_desc": "This simple application serves as a vocabulary storage tool to remember new French nouns and verbs. It includes features such as search, verb conjugation tables, and tables of gendered prepositions.",
  "trailtalk_title": "TrailTalk",
  "trailtalk_desc": "A Reddit-style social media and blogging platform designed for hikers to connect and stay informed about relevant news. Users can upload, view, and comment on posts. The platform offers voting for posts and comments, and posts can be sorted by topic or organized by date, votes, and number of comments.",
  "travelsync_title": "TravelSync",
  "travelsync_desc": "A web application that facilitates collaborative planning of group itineraries. With features such as map-based location searches, an interactive itinerary list, document storage, and details about locations.",
  "n_puzzle_title": "Solving the N-Puzzle with Deep Reinforcement Learning",
  "n_puzzle_desc": "My MSc Computer Science thesis used Python and TensorFlow to create a deep reinforcement learning model that learns to solve the N-Puzzle.",
  "original_portfolio_title": "Original Single-Page Portfolio Website",
  "original_portfolio_desc": "Although my current portfolio is built with Next.js, I value a solid foundation in web development. This original portfolio site, created with HTML, CSS, and JavaScript, showcases my ability to create responsive and user-friendly designs without relying on frameworks."
}
